<div class="alert block alert-info alert">

# <center> Scientific Programming in Python
## <center>Karl N. Kirschner<br>Bonn-Rhein-Sieg University of Applied Sciences<br>Sankt Augustin, Germany

# <center> Pandas
#### <center> (Reading in, manipulating, analyzing and visualizing datasets.)</center>

<br><br>

"...providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for practical, real-world data analysis in Python." -- http://pandas.pydata.org/pandas-docs/stable/

- Tabular data with heterogeneously-typed columns (e.g., **CSV**, SQL, LibreOffice Calc, MS **Excel**)
- Ordered and unordered time series data.
- Arbitrary matrix data with row and column labels


**Significant things to note**:
- Allows you to **operate in any direction on your data** (i.e., by rows or by columns)
    - Database experts will find this interesting
        - SQL: manipulate data by rows (i.e., **row-focused**)
        - Columnar databases: manipulate data by columns (i.e., **column-focused**)
    - Operate data on data using 1-2 lines of code


- Data structures
    - **Series** - 1-dimensional data
    - **DataFrame** - 2 dimensional data


- **Index data**
    - can organize your data quickly and logically (e.g., based on calendar dates
    - can handle missing data


- **Missing data**
    - NaN
    - mean
    - fill forward and backward

#### Basic Functionalities to Know

1. Basics: https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html
1. Head and tail: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#head-and-tail)
1. Attributes and underlying data (relevant for the numpy lecture): (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#attributes-and-underlying-data)
1. Descriptive statistics: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#descriptive-statistics)
1. Reindexing and altering labels: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#reindexing-and-altering-labels)
1. Iteration: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#iteration)
1. Sorting: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#sorting)
1. Copying: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#copying)
1. dtypes: (https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#dtypes)

#### Underlying libraries (dependencies used but not clearly seen)
1. Numpy
2. Matplotlib

<br>
    
#### Note about citations (i.e. referencing):

**For citing Pandas**: (via https://pandas.pydata.org/about/citing.html - modify for your Pandas version)

**Bibtex**

@software{reback2020pandas,  
    author       = {The pandas development team},  
    title        = {pandas-dev/pandas: Pandas},  
    month        = feb,  
    year         = 2020,  
    publisher    = {Zenodo},  
    version      = {latest},  
    doi          = {10.5281/zenodo.3509134},  
    url          = {https://doi.org/10.5281/zenodo.3509134}  
}

@InProceedings{mckinney-proc-scipy-2010,  
  author    = {{W}es {M}c{K}inney},  
  title     = {{D}ata {S}tructures for {S}tatistical {C}omputing in {P}ython},  
  booktitle = {{P}roceedings of the 9th {P}ython in {S}cience {C}onference},  
  pages     = {56 - 61},  
  year      = {2010},  
  editor    = {{S}t\'efan van der {W}alt and {J}arrod {M}illman},  
  doi       = {10.25080/Majora-92bf1922-00a}  
}

<br>
    
#### Sources
1. The pandas development team, pandas-dev/pandas: Pandas, Zenodo, 2020, https://doi.org/10.5281/zenodo.3509134, visited on May 15, 2023

2. McKinney, W., 2010, June. Data structures for statistical computing in python. In Proceedings of the 9th Python in Science Conference, van der Walt, S. & Millman, J. (Eds.), vol. 445 pp. 51-56).

3. Pandas contributors, https://pandas.pydata.org. Online; accessed on May 15, 2023.

4. Wes McKinney, Python for Data Analysis; Data Wrangling with Pandas, Numpy and Ipython, O'Reilly, Second Edition, 2018.

In [ ]:
## For extra information given within the lectures

from IPython.display import HTML


def set_code_background(color: str):
    ''' Set the background color for code cells.

        Source: psychemedia via https://stackoverflow.com/questions/49429585/
                how-to-change-the-background-color-of-a-single-cell-in-a-jupyter-notebook-jupy

        To match Jupyter's dev class colors:
            "alert alert-block alert-warning" = #fcf8e3

        Args:
            color: HTML color, rgba, hex
    '''

    script = ("var cell = this.closest('.code_cell');"
              "var editor = cell.querySelector('.input_area');"
              f"editor.style.background='{color}';"
              "this.parentNode.removeChild(this)")
    display(HTML(f'<img src onerror="{script}">'))


set_code_background(color='#fcf8e3')

In [ ]:
set_code_background(color='#fcf8e3')
print('Test for background color.')

<hr style="border:2px solid gray"></hr>

In [1]:
import pandas as pd

## Pandas Series

A series contains two components:
1. a one-dimensional array-like object that contains a sequence of data values
2. an associated array of data labels (i.e., 'index')

Note: indexes start at zero (i.e., '0')

#### Creating

Create a series that contains 5 integers:

In [2]:
series_data = pd.Series([5, 10, 15, 20, 25])
series_data

0     5
1    10
2    15
3    20
4    25
dtype: int64

#### Indexes
Now, let us add some indexes to help labels the integers:

In [11]:
series_data = pd.Series([5, 10, 15, 20, 25], index=['d', 'e', 'a', 'simulation 1', 'simulation 2'])
series_data

d                5
e               10
a               15
simulation 1    20
simulation 2    25
dtype: int64

We can alter these indexes at any time.

In [12]:
series_data.index = ['Norway', 'Italy', 'Germany', 'simulation 1', 'simulation 2']
series_data

Norway           5
Italy           10
Germany         15
simulation 1    20
simulation 2    25
dtype: int64

#### Accessing the series

Access only the values:

In [13]:
series_data.values

array([ 5, 10, 15, 20, 25])

Access only the index:

In [23]:
series_data.index

Index(['Norway', 'Italy', 'Germany', 'simulation 1', 'simulation 2'], dtype='object')

Access the data via an index label (i.e., **human readable**):

In [17]:
series_data['simulation 1']

20

Or by a position:

In [18]:
series_data[3]

20

#### Using operators

In [19]:
series_data**2

Norway           25
Italy           100
Germany         225
simulation 1    400
simulation 2    625
dtype: int64

What happens when one of the series has **missing data**?

Let's create an alternate series that has the **Italian data missing**, and then **add them** to the original series:

In [20]:
series_data_missing = pd.Series([5, 10, 20, 25], index=['Germany', 'Norway', 'simulation 1', 'simulation 2'])
series_data_missing

Germany          5
Norway          10
simulation 1    20
simulation 2    25
dtype: int64

In [21]:
series_data + series_data_missing

Germany         20.0
Italy            NaN
Norway          15.0
simulation 1    40.0
simulation 2    50.0
dtype: float64

<font color='dodgerblue'>Notice</font>:
1. The values are **correctly summed together** even though the two **lists sequences are different** (see the **Germany** values)
    - ['Norway', 'Italy', **'Germany'**, 'simulation 1', 'simulation 2']  versus
    - [**'Germany'**, 'Norway', 'simulation 1', 'simulation 2']


2. The **missing index** results in a **`NaN`**

<div class="alert alert-block alert-warning">
<hr style="border:1.5px dashed gray"></hr>

## Extra Information
### dtype
- https://pandas.pydata.org/docs/user_guide/basics.html#basics-dtypes

Pandas will default to `int64` and `float64` dtypes for numbers.

However, notice that `series_data` and `series_data_missing` were `int64`, while `series_data + series_data_missing` resulted in `float64`. This is due to Pandas' built-in **upcasting**:
    
    "Types can potentially be upcasted when combined with other types, meaning they are promoted from
    the current type (e.g., int to float)."
    
`NaN` can not included in an `int64`, but only in `float64` (which is a Numpy limitation, I believe).
<hr style="border:1.5px dashed gray"></hr>

#### Filtering and Sorting

Filter the data:

In [24]:
series_data[series_data >= 15]

Germany         15
simulation 1    20
simulation 2    25
dtype: int64

Sorting a series by its index:

In [25]:
series_data.sort_index()

Germany         15
Italy           10
Norway           5
simulation 1    20
simulation 2    25
dtype: int64

<font color='dodgerblue'>Notice</font> the sorting goes by:
1. Capital case letters (i.e. German, Italy, Norway)
1. Lower case letters (i.e. simulation 1, simulation 2)

Sorting a series by data values:

In [26]:
series_data.sort_values()

Norway           5
Italy           10
Germany         15
simulation 1    20
simulation 2    25
dtype: int64

<hr style="border:2px solid gray"></hr>

## Dataframes
- dataframes represent a **rectangular, ordered** table of data (numbers, strings, etc.)

- just like you are familiar with in a spreadsheet

Let's create a simple user function that allows us to reset our example dataframe as needed
1. First create a dictionary
2. Convert the dictionary to a dataframe

In [27]:
def dict2dataframe():
    '''Create a dataframe 'by hand' using a dictionary that has equal lengths.'''

    data = {'group': ['Deichkind', 'Die Fantastischen Vier', 'Seeed', 'Paul van Dyk'],
            'year': [2015, 2106, 2017, 2018],
            'attendence (x1000)': [50, 60, 70, 90]}

    dataframe = pd.DataFrame(data)  # convert the dictionary to a Pandas' dataframe

    return dataframe

In [28]:
example_df = dict2dataframe()
example_df

                    group  year  attendence (x1000)
0               Deichkind  2015                  50
1  Die Fantastischen Vier  2106                  60
2                   Seeed  2017                  70
3            Paul van Dyk  2018                  90

Alter these indexes in the same way we did for the series:

In [29]:
example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']
example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

Note that index doesn't need to be unique for each row, but this can cause problems (for example, when rows are deleted based on the index label).

Assign `band 1` to the first two index positions

In [30]:
example_df.index = ['band 1', 'band 1', 'band 3', 'band 4']
example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 1  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

#### Inserting columns

Insert a column with specified values:

In [31]:
example_df['quality'] = ['good', 'excellent', 'good', 'average']
example_df

                         group  year  attendence (x1000)    quality
band 1               Deichkind  2015                  50       good
band 1  Die Fantastischen Vier  2106                  60  excellent
band 3                   Seeed  2017                  70       good
band 4            Paul van Dyk  2018                  90    average

Insert a column and fill it with `NaN`:

In [32]:
example_df['number of total concerts'] = pd.Series(data='NaN')
example_df

,group,year,attendence (x1000),quality,number of total concerts
band 1,Deichkind,2015,50,good,NaN
band 1,Die Fantastischen Vier,2106,60,excellent,NaN
band 3,Seeed,2017,70,good,NaN
band 4,Paul van Dyk,2018,90,average,NaN

**Inserting rows**:

In [33]:
example_df = example_df.append({'group':'Scorpions', 'year':1965, 'attendence (x1000)':100},
                               ignore_index=True)
example_df

,group,year,attendence (x1000),quality,number of total concerts
0,Deichkind,2015,50,good,NaN
1,Die Fantastischen Vier,2106,60,excellent,NaN
2,Seeed,2017,70,good,NaN
3,Paul van Dyk,2018,90,average,NaN
4,Scorpions,1965,100,NaN,NaN

Notice
1. how the index change to integers.
1. how `NaN` is added to the columns not specified (i.e. to `quality` and `number of total concerts`)

### Dropping data entries
- pandas.drop will **drop columns** and **rows** using the **axis** keyword
    - `axis='rows'` ;`axis=0` ; `axis='index'`
    - `axis='columns'` ; `axis=1`

#### Removing columns
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html
- axis='columns' ; axis=1

In [34]:
example_df = example_df.drop(['year'], axis='columns')
example_df

,group,attendence (x1000),quality,number of total concerts
0,Deichkind,50,good,NaN
1,Die Fantastischen Vier,60,excellent,NaN
2,Seeed,70,good,NaN
3,Paul van Dyk,90,average,NaN
4,Scorpions,100,NaN,NaN

Interestingly, you don't need the list brackets:

In [35]:
example_df = example_df.drop('attendence (x1000)', axis='columns')
example_df

                    group    quality number of total concerts
0               Deichkind       good                      NaN
1  Die Fantastischen Vier  excellent                      NaN
2                   Seeed       good                      NaN
3            Paul van Dyk    average                      NaN
4               Scorpions        NaN                      NaN

In [36]:
example_df = example_df.drop(['quality', 'number of total concerts'], axis='columns')
example_df

                    group
0               Deichkind
1  Die Fantastischen Vier
2                   Seeed
3            Paul van Dyk
4               Scorpions

#### Removing rows
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html
- `axis='row'` ; `axis='rows'` ;`axis=0` ; `axis='index'`

In [37]:
example_df = example_df.drop([0], axis='index')
example_df

                    group
1  Die Fantastischen Vier
2                   Seeed
3            Paul van Dyk
4               Scorpions

As with columns, not specifing the list brackets also works:

In [38]:
example_df = example_df.drop(1, axis='index')
example_df

          group
2         Seeed
3  Paul van Dyk
4     Scorpions

In [39]:
example_df = example_df.drop([3, 4], axis='rows')
example_df

   group
2  Seeed

**Additional examples**

Indexes that are strings

In [40]:
example_df = dict2dataframe()
example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']
example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [41]:
example_df.drop(['band 2', 'band 3'], axis='rows')

               group  year  attendence (x1000)
band 1     Deichkind  2015                  50
band 4  Paul van Dyk  2018                  90

What happens if you have rows with the same index?

Let's reset, and set two rows as `band 3`:

In [42]:
example_df = dict2dataframe()
example_df.index = ['band 1', 'band 3', 'band 3', 'band 4']
example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 3  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [43]:
example_df = example_df.drop(['band 3'])
example_df

               group  year  attendence (x1000)
band 1     Deichkind  2015                  50
band 4  Paul van Dyk  2018                  90

<hr style="border:2px solid gray"></hr>

## Accessing, selecting and filtering data
- there are many ways to do this (df: dataframe)
    - `df[val]` and `df[[]]`
    - `df.loc[val]`: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html
    - `df.loc[row_val, col_val]`
    - `df.iloc[row_index, col_index]`: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc
    - and more
    
**Suggestion** - choose one method(e.g., `df.loc`) and learn it first

- Reset the example, and
- Reindex the dataframe:

In [44]:
example_df = dict2dataframe()
example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']

example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

#### Accessing/Selecting rows (by the index)

<font color='dodgerblue'>**Single row:**</font>
- Using slicing `:`

via index names:

In [45]:
example_df['band 1':'band 1']

            group  year  attendence (x1000)
band 1  Deichkind  2015                  50

via index numbers:

In [46]:
example_df[0:1]

            group  year  attendence (x1000)
band 1  Deichkind  2015                  50

via a specified list:
- `loc` with double `[[ ]]` (i.e., pass a list)

In [74]:
example_df.loc[['band 1']]

            group  year  attendence (x1000)  number of total concerts
band 1  Deichkind  2015                  50                       NaN

<font color='dodgerblue'>**Multiple rows**</font>

- Using slicing `:`

via index names:

In [75]:
example_df['band 1':'band 3']

,group,year,attendence (x1000),number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,10000.0

via index numbers:

In [76]:
example_df[0:3]

,group,year,attendence (x1000),number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,10000.0

via a specified list:
- `loc` with double `[[ ]]`

**Notice**: How we skip `band 2` in the following, so it is really is not a range.

In [62]:
example_df.loc[['band 1', 'band 3']]

            group  year  attendence (x1000)  number of total concerts
band 1  Deichkind  2015                  50                       NaN
band 3      Seeed  2017                  70                   10000.0

#### Access a specific cell (index, labels)

In [63]:
example_df.loc['band 3', 'group']

'Seeed'

Or by index number
- `iloc`

In [64]:
example_df.iloc[2, 0]

'Seeed'

#### Substitute a value at a specific cell

In [65]:
example_df.loc['band 3', 'number of total concerts'] = 10000
example_df

,group,year,attendence (x1000),number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,10000.0
band 4,Paul van Dyk,2018,90,NaN

### Accessing/Selecting columns

#### Accessing columns (by label)

<font color='dodgerblue'>Single column:</font>

In [66]:
example_df['group']

band 1                 Deichkind
band 2    Die Fantastischen Vier
band 3                     Seeed
band 4              Paul van Dyk
Name: group, dtype: object

<font color='dodgerblue'>Multiple column:</font>

- the double `[[ ]]` (i.e., pass a list to the dataframe)

In [67]:
example_df[['group', 'year']]

                         group  year
band 1               Deichkind  2015
band 2  Die Fantastischen Vier  2106
band 3                   Seeed  2017
band 4            Paul van Dyk  2018

Alternative approaches
- the `df.columns` command

In [73]:
example_df[example_df.columns[0:2]]

                         group  year
band 1               Deichkind  2015
band 2  Die Fantastischen Vier  2106
band 3                   Seeed  2017
band 4            Paul van Dyk  2018

- `loc`

Notice that the rows designation is left as `:`, followed by a `,` and then the columns

In [69]:
example_df.loc[:, 'group':'attendence (x1000)']

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [70]:
example_df

,group,year,attendence (x1000),number of total concerts
band 1,Deichkind,2015,50,NaN
band 2,Die Fantastischen Vier,2106,60,NaN
band 3,Seeed,2017,70,10000.0
band 4,Paul van Dyk,2018,90,NaN

Now, let's putting everything together
- slicing for rows (e.g. `'band 1':'band 3'`) and
- slicing the columns (e.g. `'group':'attendence (x1000)'`)

In [71]:
example_df.loc['band 1':'band 3', 'group':'attendence (x1000)']

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70

<hr style="border:2px solid gray"></hr>

## Essential Functions

### Reminder about reordering the rows by their indexes

- demonstrates what happens to a dataframe with multiple columns

- `reindex`

In [77]:
example_df = dict2dataframe()
example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']

example_df

                         group  year  attendence (x1000)
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90

In [78]:
example_df = example_df.reindex(['band 3', 'band 4', 'band 1', 'band 2'])
example_df

                         group  year  attendence (x1000)
band 3                   Seeed  2017                  70
band 4            Paul van Dyk  2018                  90
band 1               Deichkind  2015                  50
band 2  Die Fantastischen Vier  2106                  60

### Factorize categorical data
- This is something that is sometimes done when performing data analysis
    - e.g. Machine learning
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.factorize.html

In [79]:
example_df = dict2dataframe()

example_df.index = ['band 1', 'band 2', 'band 3', 'band 4']

example_df['quality'] = ['good', 'excellent', 'good', 'average']

example_df

                         group  year  attendence (x1000)    quality
band 1               Deichkind  2015                  50       good
band 2  Die Fantastischen Vier  2106                  60  excellent
band 3                   Seeed  2017                  70       good
band 4            Paul van Dyk  2018                  90    average

In [80]:
codes, uniques = example_df['quality'].factorize()

In [81]:
codes

array([0, 1, 0, 2])

In [82]:
uniques

Index(['good', 'excellent', 'average'], dtype='object')

In [83]:
example_df['quality_numeric'] = codes
example_df

,group,year,attendence (x1000),quality,quality_numeric
band 1,Deichkind,2015,50,good,0
band 2,Die Fantastischen Vier,2106,60,excellent,1
band 3,Seeed,2017,70,good,0
band 4,Paul van Dyk,2018,90,average,2

### Iterate over rows
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html#pandas-dataframe-iterrows

In [84]:
for index, row in example_df.iterrows():
    print(f"Index: {index} ; Group: {row['group']}")
    print()

Index: band 1 ; Group: Deichkind

Index: band 2 ; Group: Die Fantastischen Vier

Index: band 3 ; Group: Seeed

Index: band 4 ; Group: Paul van Dyk

### tolists
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.tolist.html

First let's see what `dataframe.columns` does
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html

In [85]:
example_df.columns

Index(['group', 'year', 'attendence (x1000)', 'quality', 'quality_numeric'], dtype='object')

Convert column names to a list

In [86]:
example_df.columns.tolist()

['group', 'year', 'attendence (x1000)', 'quality', 'quality_numeric']

<hr style="border:2px solid gray"></hr>

## Combining dataframes
- take the columns from different dataframes and put them together into a single column
    1. concat: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html#pandas.concat
    2. append

**Example** - student grades on homework

In [87]:
homework_1_grades = pd.DataFrame({'student': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
                                  'homework 1': [63.0, 76.0, 76.0,
                                                 76.0, 0.0, 0.0, 
                                                 88.0, 86.0, 76.0,
                                                 86.0, 70.0, 0.0, 80.0]})
homework_1_grades

    student  homework 1
0         1        63.0
1         2        76.0
2         3        76.0
3         4        76.0
4         5         0.0
5         6         0.0
6         7        88.0
7         8        86.0
8         9        76.0
9        10        86.0
10       11        70.0
11       12         0.0
12       13        80.0

In [88]:
homework_2_grades = pd.DataFrame({'student': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
                                  'homework 2': [70.0, 73.0, 91.0,
                                                 89.0, 58.0, 0.0,
                                                 77.0, 91.0, 86.0,
                                                 78.0, 100.0, 61.5, 71.0]})
homework_2_grades

    student  homework 2
0         1        70.0
1         2        73.0
2         3        91.0
3         4        89.0
4         5        58.0
5         6         0.0
6         7        77.0
7         8        91.0
8         9        86.0
9        10        78.0
10       11       100.0
11       12        61.5
12       13        71.0

In [89]:
new_df_concat = pd.concat([ homework_1_grades['homework 1'], homework_2_grades['homework 2'] ], axis='rows')
new_df_concat

0      63.0
1      76.0
2      76.0
3      76.0
4       0.0
5       0.0
6      88.0
7      86.0
8      76.0
9      86.0
10     70.0
11      0.0
12     80.0
0      70.0
1      73.0
2      91.0
3      89.0
4      58.0
5       0.0
6      77.0
7      91.0
8      86.0
9      78.0
10    100.0
11     61.5
12     71.0
dtype: float64

In [90]:
type(new_df_concat)

pandas.core.series.Series

An alternative approach using `append`:

In [91]:
new_df_append = homework_1_grades['homework 1'].append(homework_2_grades['homework 2'])
new_df_append

0      63.0
1      76.0
2      76.0
3      76.0
4       0.0
5       0.0
6      88.0
7      86.0
8      76.0
9      86.0
10     70.0
11      0.0
12     80.0
0      70.0
1      73.0
2      91.0
3      89.0
4      58.0
5       0.0
6      77.0
7      91.0
8      86.0
9      78.0
10    100.0
11     61.5
12     71.0
dtype: float64

In [92]:
type(new_df_append)

pandas.core.series.Series

- Combine two dataframe based on common keys.
    1. merge: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.merge.html#pandas.merge
    
(This is just one example of many ways to do this, including when the keys might not be shared.)

In [93]:
pd.merge(homework_1_grades, homework_2_grades, on='student')

    student  homework 1  homework 2
0         1        63.0        70.0
1         2        76.0        73.0
2         3        76.0        91.0
3         4        76.0        89.0
4         5         0.0        58.0
5         6         0.0         0.0
6         7        88.0        77.0
7         8        86.0        91.0
8         9        76.0        86.0
9        10        86.0        78.0
10       11        70.0       100.0
11       12         0.0        61.5
12       13        80.0        71.0

<hr style="border:2px solid gray"></hr>

## Math operators

Let's perform some math on a dataframe.

Dataframe:
- 5 rectangles that are defined by
    - length
    - height

In [ ]:
rectangles_dict = {'length': [0.1, 9.4, 6.2, 3.8, 9.4],
                   'height': [8.7, 6.2, 9.4, 5.6, 3.3]}

rectangles_data = pd.DataFrame(rectangles_dict)
rectangles_data

#### Operate on all columns (e.g. dividing by 10)

In [ ]:
rectangles_data/10

#### Operation using two columns (e.g. for the area of a rectangle)

In [ ]:
rectangles_data['length'] * rectangles_data['height']

#### Create a new column based on math using other columns

In [ ]:
rectangles_data['area'] = rectangles_data['length'] * rectangles_data['height']
rectangles_data

### Descriptive statistics

Using **python built-in functions** (e.g. max, min) on a Pandas dataframe:

In [ ]:
max(rectangles_data['area'])

In [ ]:
min(rectangles_data['area'])

Notice above: how the dataframe is given within the parentheses.

Using **pandas functions**

- count (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.count.html)
- sum (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sum.html)
- median (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.median.html)
- std (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.std.html)
- var (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.var.html)
- max (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.max.html)
- min (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.min.html)
- correlation analysis (https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.corr.html)
- and many more



**Notice below** how **the dataframe is given first**, followed by the function (e.g. `df.max()`)

On all dataframe columns:

In [ ]:
rectangles_data.max()

One a specific column:

In [ ]:
rectangles_data['area'].max()

`idxmin` and `idxmax`

"Return **index** of the first occurrence of maximum over requested axis."[1]

1. https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmax.html

In [ ]:
rectangles_data

In [ ]:
maximum_index = rectangles_data['area'].idxmax()
maximum_index

In [ ]:
rectangles_data.loc[maximum_index]['area']

In [ ]:
rectangles_data.loc[maximum_index]['length']

But **note** it is the **FIRST OCCURRENCE**
- Returns the row with a length=9.4, width=6.2 and an area=58.28 (i.e. index = 1)
- It does NOT return values for the rows that contain
    - length=6.2, width=9.4 and an area=58.28 (i.e. index=2)

In [ ]:
rectangles_data['area'].count()

In [ ]:
rectangles_data['area'].mean()

In [ ]:
rectangles_data['area'].std()

#### Moving averages (data smoothing)
- https://en.wikipedia.org/wiki/Moving_average

- rolling mean of data via pandas

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rolling.html?highlight=rolling#pandas.DataFrame.rolling

In [ ]:
rectangles_data['area moving avg'] = rectangles_data['area'].rolling(window=2, win_type=None).mean()
rectangles_data

### Unique values

In [ ]:
rectangles_data['area'].unique()

- Unique values and count their occurance

In [ ]:
rectangles_data['area'].value_counts()

#### How to using other libraries (e.g. statistics)
- Make sure you have a good reason to do this (i.e. be consistent)
- Notice that the format is similar to using a built-in function (shown above)

In [ ]:
import statistics
statistics.mean(rectangles_data['area'])

### Sorting dataframes
- similar to how the series was done above, but with a twist
- https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html
- `df.sort_values()`

Our original, unsorted dataframe:

In [ ]:
rectangles_data

- sort by a single column's values

In [ ]:
rectangles_data.sort_values(by='area')

- sort by multiple columns
    - consecutively done

In [ ]:
## rows index 1 and 2 should switch due to length value
rectangles_data.sort_values(by=['area', 'length'])

### Filter by boolean operators

In [ ]:
rectangles_data

In [ ]:
rectangles_data['area'] > 7.0

#### return a dataframe based on one boolean condition

In [ ]:
rectangles_data[rectangles_data['area'] > 7.0]

#### return a dataframe based on multiple boolean condition

In [ ]:
rectangles_data[ (rectangles_data['area'] > 7.0) & (rectangles_data['area'] < 50.0) ]

---
## Data from a csv-formatted file

- The example CSV data file used below can be found at https://github.com/karlkirschner/2020_Scientific_Programming/blob/master/data_3d.csv

In [ ]:
## For Colabs

## In order to upload data

#from google.colab import files
#uploaded = files.upload()

In [ ]:
!head data_3d.csv --lines=10

For files without a header you can:
1. have pandas assign an index value as the header (e.g. 1 2 3)

In [ ]:
df = pd.read_csv('data_3d.csv', header=None, sep=',')
df

2. Read in a csv file, using the first row (i.e. 0) as the header, with a comma separator

In [ ]:
df = pd.read_csv('data_3d.csv', header=0, sep=',')
df

3. Assign the headers yourself
     - use `skiprows` if the first row labels are present, as in this example

In [ ]:
df = pd.read_csv('data_3d.csv', sep=',', skiprows=1, names=['header 1', 'header 2', 'average'])
df

####  Save data to a new csv file, printing out to the first decimal place

In [ ]:
df.to_csv('pandas_out.csv',
          sep=',', float_format='%.1f',
          index=False, encoding='utf-8')

<hr style="border:2px solid gray"></hr>

## Visualizing the data via Pandas plotting

https://pandas.pydata.org/pandas-docs/version/0.23.4/generated/pandas.DataFrame.plot.html


#### Types of plots

The type of plot is specified through the pandas.DataFrame.plot's `kind` keyword.

1. ‘line’ : line plot (default)
1. ‘bar’ : vertical bar plot
1. ‘barh’ : horizontal bar plot
1. ‘hist’ : histogram
1. ‘box’ : boxplot
1. ‘kde’ : Kernel Density Estimation plot
1. ‘density’ : same as ‘kde’
1. ‘area’ : area plot
1. ‘pie’ : pie plot
1. ‘scatter’ : scatter plot
1. ‘hexbin’ : hexbin plot

In [ ]:
df = pd.read_csv('data_3d.csv', header=0, sep=',')

In Pandas v. 1.1.0, xlabel and ylabel was introduced:

In [ ]:
## kind = line, box, hist, kde

df.plot(x='Time', y=['Exp', 'Theory'], kind='line',
        xlabel='X-Label', ylabel='Y-Label',
        title=['Example Plot: Exp', 'Example Plot: Theory'], fontsize=16, subplots=True)

An **alternative way** (also usable with older Pandas version) that gives you a bit **more control** over, for example
1. the fontsize of different elements, for example
    - axis label
    - title
1. legend location

This is similar to how matplotlib works.

In [ ]:
graphs = df.plot(x='Time', y=['Exp', 'Theory'], kind='line', fontsize=16, subplots=True)

graphs[0].set_title("Example Plot: Exp", fontsize=16)
graphs[0].set_ylabel("X-Label", fontsize=16)
graphs[0].legend(loc='upper left')

graphs[1].set_title("Example Plot: Theory", fontsize=16)
graphs[1].set_xlabel("X-Label", fontsize=16)
graphs[1].set_ylabel("Y-Label", fontsize=16)
graphs[1].legend(loc='upper left')

#### Combining multiple data lines onto one plot
- demo by doing a rolling average on the above theory data and then plotting it.

In [ ]:
df['Exp Rolling'] = df['Exp'].rolling(window=4, win_type=None).mean()
df['Theory Rolling'] = df['Theory'].rolling(window=4, win_type=None).mean()
df

In [ ]:
df.plot(x='Time', y=['Theory', 'Theory Rolling'], kind='line',
        title='Example Plot', fontsize=16)

<hr style="border:2px solid gray"></hr>

# Side Topics

## Pandas to Latex
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_latex.html

In [ ]:
print(df.to_latex(index=False))

***
## Import Data from a European data csv file
(e.g. decimal usage: 10.135,11)

In [ ]:
## CSV data file acan be found at
## https://github.com/karlkirschner/2020_Scientific_Programming/blob/master/data_eu.csv

## For Colabs

## In order to upload data

#from google.colab import files
#uploaded = files.upload()

In [ ]:
!head data_eu.csv --lines=10

In [ ]:
df = pd.read_csv('data_eu.csv', decimal=',', thousands='.', sep=';')
df.columns
df['Value']